Public Attributes | List of all members
API_RailingInnerPostQuantity Struct Reference
Element Manager API
Calculated values for the railing inner posts. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | volume
Volume of the railing inner post.
double  | length3D
Length of the 3D reference line of the railing inner post.
Detailed Description
Calculated values for the railing inner posts.
Member Data Documentation
◆ length3D
 API_RailingInnerPostQuantity::length3D
Length of the 3D reference line of the railing inner post.
◆ volume
 API_RailingInnerPostQuantity::volume
Volume of the railing inner post.